Revit 2024 API
ColorSelectionDialog Methods
The ColorSelectionDialog type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Show
 Shows the Revit Color dialog as a modal dialog.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ColorSelectionDialog Class
Autodesk.Revit.UI Namespace